# Вам доступен класс House, описывающий дом. При создании экземпляра класс принимает два аргумента в следующем порядке:
#
# color — цвет дома
# rooms — количество комнат в доме
# Экземпляр данного класса имеет два атрибута:
#
# color — цвет дома
# rooms — количество комнат в доме
# Реализуйте для класса House два метода экземпляра:
#
# paint() — метод, принимающий в качестве аргумента значение new_color и изменяющий текущий цвет дома на new_color
# add_rooms() — метод, принимающий в качестве аргумента целое число n и увеличивающий количество комнат в доме на n

